#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=e702d3fa-02ff-4ea9-a17a-ad5a0b9349a5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # openstack_compute_instance_v2.cloud-info has been deleted
  - resource "openstack_compute_instance_v2" "cloud-info" {
      - access_ip_v4        = "192.168.1.251" -> null
      - all_metadata        = {} -> null
      - all_tags            = [] -> null
      - availability_zone   = "nova" -> null
      - flavor_id           = "737f8483-8063-4567-a8e5-e09a4bcbdb49" -> null
      - flavor_name         = "svc1.m" -> null
      - force_delete        = false -> null
      - id                  = "e702d3fa-02ff-4ea9-a17a-ad5a0b9349a5" -> null
      - image_id            = "97624935-200f-4670-9ea8-c65282adbe56" -> null
      - image_name          = "ubuntu-18.04-amd64-raw" -> null
      - name                = "cloud-info" -> null
      - power_state         = "active" -> null
      - security_groups     = [
          - "default",
        ] -> null
      - stop_before_destroy = false -> null
      - user_data           = "a988019d47dba22eab4b6f72d6fc301ddf1c740a" -> null

      - network {
          - access_network = false -> null
          - fixed_ip_v4    = "192.168.1.251" -> null
          - mac            = "fa:16:3e:1c:8f:ac" -> null
          - name           = "cloud_egi_net" -> null
          - uuid           = "f15a0e1f-570e-4135-9739-a59b8c2b3e8e" -> null
        }
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info will be created
  + resource "openstack_compute_instance_v2" "cloud-info" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = "36ca4d2e-6df5-4bf3-9dc6-27b0c8bc8c35"
      + flavor_name         = (known after apply)
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "4d8d690c-20ba-4fee-980f-72d4bfd05ead"
      + image_name          = (known after apply)
      + name                = "cloud-info"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "c9a608eb5acf7eb7fa8e05bf513ed1512d2ec485"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = (known after apply)
          + port           = (known after apply)
          + uuid           = "d95ef0fe-bec9-4b90-ba34-a21204413098"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*